mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function activates reset impulse needed on device initialization.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    08.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_initReset(BSP_ECG_ADS1192_device_S *inDevice,
                                      BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set nRESET pin high
    nrf_gpio_pin_set(ECG_RST);
    // wait 1s, according to datasheet power-up sequence
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    /* hold nRESET low for 1 period of fMOD frequency,
     * according to datasheet, fMOD = 128kHz -> tMOD = 8us*/
    nrf_gpio_pin_clear(ECG_RST);
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_1_FMOD);

    // set nRESET pin high again
    nrf_gpio_pin_set(ECG_RST);

    // wait 18 * tCLK, with fCLK = 512kHz -> tCLK = 2us
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_18_TCLK);

    // reset device registers to default values
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RESET, &ecgErr);
    // wait 9 * fMOD cycles for RESET command to finish executing
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_9_FMOD);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Sets device MUX to read temperature from device sensor.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_updateTemperature(BSP_ECG_ADS1192_device_S *inDevice,
                                              BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0u };

    // set channel 2 for temp measurement
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        // set PGA to 1x
        chReg.B.pga = 1u;
        chReg.B.mux = 4u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // start reading data
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
    }
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_4_TCLK);

    int16_t readVal = outBuffer[4] << BSP_ECG_ADS1192_TEMP_BIT_MASK;
    readVal = readVal | outBuffer[5];
    // set device temperature
    inDevice->temperature = (((readVal - BSP_ECG_ADS1192_TEMP_CONST_1) / BSP_ECG_ADS1192_TEMP_CONST_2)
            + BSP_ECG_ADS1192_TEMP_CONST_3);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function reads test signal.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readTestSignal(BSP_ECG_ADS1192_device_S *inDevice,
                                           BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0 };

    // set CONFIG 2 register for test signal
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbRefBuf = 1u;
    conf2Reg.B.intTest = 1u;
    conf2Reg.B.testFreq = 1u;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
                             BSP_ECG_ADS1192_reg_CONFIG_2,
                             (uint8_t *) &conf2Reg,
                             &ecgErr);

    BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
    chReg.B.mux = BSP_ECG_ADS1192_MUX_TEST_SIGNAL;
    // set both channels to output test signal
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH1_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

