mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
        for(uint8_t i = 0u; i<6; i++) {
            SEGGER_RTT_printf(0, "%x\n", outBuffer[i]);
        }
    }

//    // issue read command
//    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
//    // wait 4 * tCLK after sending SDATAC command
//    nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for detecting if Right-Leg Drive off - not connected.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    29.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectLeadOff(BSP_ECG_ADS1192_device_S *inDevice,
                                          BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set Lead-off comparator threshold
    uint8_t loffReg = 0x1Cu;
    BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF, &loffReg, &ecgErr);

    // configure Configuration 2 register for lead-off detection
    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0x80u };
    conf2Reg.B.pdbLoffComp = 1u;
    conf2Reg.B.pdbRefBuf = 1u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                       BSP_ECG_ADS1192_reg_CONFIG_2,
                                       (uint8_t *) &conf2Reg,
                                       &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    // configure LOFF_SENS register - both channels P+ and N- for lead-off detection
    uint8_t loffSensReg = 0x0Fu;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_SENS, &loffSensReg, &ecgErr);
    }

//    // configure RLD_SENS register - both channels P+ and N- for lead-off detection
//    uint8_t rldSensReg = 0x1Fu;
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_RLD_SENS, &rldSensReg, &ecgErr);
//    }

    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

    /* read data shifted out from device:
     * 16 status bits + 2 channels x 16 bits */
    uint8_t outBuffer[6] = { 0 };
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
    }

    // read Lead-off Status register
    uint8_t outData[10] = { 0u };
    uint8_t stat;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        stat = BSP_ECG_ADS1192_readSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_STAT, &(outData[0]), &ecgErr);
        if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
            // check if RLD_OFF bit is set
            if((outData[2] & BSP_ECG_ADS1192_RLD_OFF_MASK) == false) {
                ecgErr = BSP_ECG_ADS1192_err_RLD_OFF;
            }
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function configures registers for ECG signal read operation.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_measureRldSignal(BSP_ECG_ADS1192_device_S *inDevice,
                                             BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0 };

    // configure RLD_SENS register, channel 1 to RLD, buffer enabled
    uint8_t rldSensVal = 0x23u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_RLD_SENS, &rldSensVal, &ecgErr);
    }

//    // enable RLD_REF_INT
//    uint8_t misc2Reg = 0x02u;
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_MISC_2, 1u, &misc2Reg, 1u, &ecgErr);
//    }

    // set channel 1 to normal input
    uint8_t ch1Reg = 0x00u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH1_SET,
                                 &ch1Reg,
                                 &ecgErr);
    }

    // set channel 2 to RLD measure
    uint8_t ch2Reg = 0x02u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 &ch2Reg,
                                 &ecgErr);
    }


    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATAC, &ecgErr);

    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
        for(uint8_t i = 0u; i<6; i++) {
            SEGGER_RTT_printf(0, "%x\n", outBuffer[i]);
        }
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 *                          END OF FILE
 ******************************************************************************/
